Repository: gallandarakhneorg/autolatex
Catalog: po/*/LC_MESSAGES/autolatex.po
Languages: fr

source: No LaTeX file found nor specified for the directory '{}'. You must specify one on the command line option -f, or set the the variable 'generation.main file' in your configuration file, rename one of your files 'Main.tex'.
fr: Pas de fichier LaTeX trouvé dans le répertoire '{}', ni spécifié dans les fichiers de configuration. Vous devez spécifier un fichier LaTeX a traiter soit avec l'option de la ligne de commande -f, soit en donnant une valeur à la variable 'generation.main file' dans l'un de vos fichiers de configuration, soit renommer l'un de vos fichiers TeX avec le nom 'Main.tex'.

source: Translating from {}
fr: Conversion de {}

source: The configuration entry '{}' is not defined.
fr: Le clé de configuration '{}' n'est pas définie.

source: Launching '{}'
fr: Lancement de '{}'

source: Launching '{}' in background
fr: Lancement de '{}' en tâche de fond

source: Unable to find a viewer.
fr: Impossible de trouvé un visualisateur.

source: Removing all the temporary files
fr: Suppression de tous les fichiers temporaires

source: Removing all the temporary and generated files
fr: Suppression des fichiers temporaires et des figures générées

source: Command line action '{}' is not supported.
fr: L'option de ligne de commande '{}' n'est pas reconnue.

source: Creating default project configuration file...
fr: Création du fichier de configuration du project...

source: Creating default user configuration file...
fr: Création du fichier de configuration utilisateur...

source: Creating default makeindex style file...
fr: Création du fichier de style par défaut pour makeindex...

source: Output the configuration for the given level. If the 4th param is given, output only the section with this name. If section is "__private__", the hidden configuration is output.
fr: Affiche la configuration pour le niveau donné. Si le 4ème paramètre est donné, affiche seulement la section associée à ce niveau. Si la section est "__private__", la configuration cachée est affichée.

source: Output the list of the installed translators.
fr: Affiche la liste des convertisseurs installés.

source: Output the translators potentially under conflicts. If 'resolved' is given, apply the resolution mechanism.
fr: Affiche les convertisseurs potentiellement en conflit. Si 'resolved' est donné, le mécanisme de résolution est appliqué avant l'affichage.

source: Output the loading directives for translators.
fr: Affiche les directives de chargement des convertisseurs.

source: Output the list of figures detected by AutoLaTeX.
fr: Affiche la liste des figures détectées par AutoLaTeX.

source: Read from STDIN an ini file that is a new configuration for the given level. The boolean param indicates if the configuration keys that are not given on STDIN will be removed (if true) or skipped (if false, the default) during the setting process.
fr: Lit un fichier ini depuis STDIN. Ce fichier contient la nouvelle configuration pour le niveau donné. The paramètre booléen indique si les clés qui ne sont pas présentés dans la nouvelle configuration sont supprimées (true), ou non changées false, par défaut) dans la configuration réellement écrite.

source: Read from STDIN an ini file for the loading directives of translators.
fr: Lit un fichier ini depuis STDIN contenant les directives de chargement des convertisseurs.

source: Read from STDIN an ini file that is describing the attributes for the translators. The boolean param indicates if the configuration keys that are not given on STDIN will be removed (if true) or skipped (if false, the default) during the setting process.
fr: Lit un fichier ini depuis STDIN. Ce fichier contient les attributs des convertisseurs. The paramètre booléen indique si les clés qui ne sont pas présentés dans la nouvelle configuration sont supprimées (true), ou non changées false, par défaut) dans la configuration réellement écrite.

source: Configuration of the viewing functions
fr: Configuration des fonctions d'affichage

source: Configuration of the generation functions
fr: Configuration des fonctions de génération

source: Configuration of the several cleaning functions
fr: Configuration des fonctions de nettoyage

source: Configuration of the SCM functions
fr: Configuration des fonctions SCM

source: GTK interface configuration
fr: Configuration de l'interface GTK

source: Qt interface configuration
fr: Configuration de l'interface Qt

source: Windows interface configuration
fr: Configuration de l'interface Windows

source: MacOS interface configuration
fr: Configuration de l'interface MacOS

source: wxWidgets interface configuration
fr: Configuration de l'interface wxWidgets

source: List of additional files to remove when cleaning (shell wild cards are allowed). This list is used when the target 'clean' is invoked.
fr: Liste des fichiers additionnels devant être supprimés durant l'opération de nettoyage simple (les meta-caractères shell sont utilisables). Cette liste est utilisée par l'action 'clean'.

source: List of additional files to remove when all cleaning (shell wild cards are allowed). This list is used when the target 'cleanall' is invoked.
fr: Liste des fichiers additionnels devant être supprimés durant l'opération de nettoyage complet (les meta-caractères shell sont utilisables). Cette liste est utilisée par l'action 'cleanall'.

source: Indicates if bibliography tool (bibtex,biber) should be run ('yes' or 'no').
fr: Indique si bibtex doit être executé ('yes' ou 'no').

source: Does the figures must be automatically generated ('yes' or 'no')?
fr: Est-ce que les figures sont automatiquement générées ('yes' or 'no') ?

source: Specify the directories inside which AutoLaTeX will find the pictures which must be processed by the translators. Each time this option is put on the command line, a directory is added inside the list of the directories to explore. The different paths are separated by the path-separator character (':' on Unix, ';' on Windows)
fr: Répertoires dans lesquels AutoLaTeX recherche les images à transformer en PDF ou en PNG. A chaque fois que cette option apparait sur la ligne de commande, le répertoire spécifié est ajouté dans la liste de recherche. Les différents répertoires spécifiés sont alors séparés par le caractère séparateur standard (':' sur Unix, ';' sur Windows)

source: Main filename (this option is only available in project's configuration files).
fr: Fichier principal (cette option est supportée uniquement dans les fichiers de configuration de documents).

source: Type of generation. pdf : use pdflatex to create a PDF document.
fr: Type de génération. pdf : utilise pdflatex pour créer le document PDF.

source: Specify the style that must be used by makeindex. Valid values are: <filename> if a filename was specified, AutoLaTeX assumes that it is the .ist file; @system AutoLaTeX uses the system default .ist file (in AutoLaTeX distribution); @detect AutoLaTeX will tries to find a .ist file in the project's directory. If none was found, AutoLaTeX will not pass a style to makeindex; @none AutoLaTeX assumes that no .ist file must be passed to makeindex; <empty> AutoLaTeX assumes that no .ist file must be passed to makeindex.
fr: Spécifle le style devant être utilisé par makeindex. Valeurs autorisées : <filename> si un nom de fichier est spécifié, AutoLaTeX considère qu'il s'agit du fichier .ist à utiliser; @system AutoLaTeX utilise le fichier .ist du système; @detect AutoLaTeX recherche le fichier .ist dans le répertoire du document. S'il n'y a pas de fichier .ist, AutoLaTeX ne passera pas de style à makeindex; @none AutoLaTeX ne passe aucun fichier a.ist à makeindex; <empty> AutoLaTeX ne passe aucun fichier a.ist à makeindex.

source: Defines the paths from which the translators could be loaded. This is a list of paths separated by the path separator character used by your operating system: ':' on Unix platforms or ';' on Windows platforms for example.
fr: Définition des répertoires dans leqquels les convertisseurs peur être trouvés. C'est une liste de chemins séparés par le caractère séparateur de votre système d'exploitation : ':' sous Unix ou ';' sous Windows par exemple.

source: Indicates if the PDF document must be produced with the SyncTeX flag on or not. SyncTeX enables to link a PDF viewer (as evince) and a text editor (as Gedit). When you click inside one, the other is highlighting the line in its side.
fr: Indique si le document PDF doit être produit avec SyncTeX, ou non. SyncTeX permet de lié un visualisateur PDF (comme evince) et un éditeur de text (comme Gedit). Lorsque vous cliquez dans l'un, l'autre logiciel affiche en surbrillance la ligne correspondante de son côté.

source: Tool to launch when a SCM commit action is requested. Basically the SCM tools are CVS, SVN, or GIT.
fr: Outils à lancer lors d'une action d'enregistrement dans un SCM. Les outils SCM connus sont : CVS, SVN, GIT.

source: Tool to launch when a SCM update action is requested. Basically the SCM tools are CVS, SVN, or GIT.
fr: Outils à lancer lors d'une action de raffaichissement depuis un SCM. Les outils SCM connus sont : CVS, SVN, GIT.

source: Indicates if a viewer should be launch after the compilation. Valid values are 'yes' and 'no'.
fr: Indique si un visualisateur doit être lancé après la génération du document. Valeurs autorisées : 'yes' et 'no'.

source: Specify, if not commented,the command line of the viewer.
fr: Ligne de commande du visualisateur, si non commenté.

source: Indicates if the viewer is launched in background, or not.
fr: Indique si le visualisateur est lancé en tâche de fond, ou non.

source: Opening configuration file {}
fr: Ouverture du fichier de configuration {}

source: Succeed on reading
fr: Succès de la lecture

source: Failed to read {}: {}
fr: Echec de lecture de {}: {}

source: Writing configuration file {}
fr: Enregistrement du fichier de configuration {}

source: Adding configuration comments
fr: Ajout des commentaires dans la configuration

source: Configuration of the translator
fr: Configuration du convertisseur

source: Saving configuration comments
fr: Enregistrement des commentaires dans la configuration

source: AutoLaTeX has detecting an old fashion syntax for the configuration file {} Please regenerate this file with the command line option --fixconfig.
fr: AutoLaTeX a détecter l'utilisation d'une syntaxe obsolète dans le fichier de configuration {}. Veuillez re-générer ce fichier en utilisant l'option de la ligne de commande --fixconfig.

source: Reading command line options
fr: Lecture des options de la ligne de commande

source: {} {} ({}) - {} platform (c) 1998-{} Stephane GALLAND <galland@arakhne.org> (under GPL)
fr: {} {} ({}) - plate-forme {} (c) 1998-{} Stéphane GALLAND <galland@arakhne.org> (sous GPL)

source: {} {} - {} platform (c) 1998-{} Stephane GALLAND <galland@arakhne.org> (under GPL)
fr: {} {} - plate-forme {} (c) 1998-{} Stéphane GALLAND <galland@arakhne.org> (sous GPL)

source: Selecting TeX file '{}'
fr: Sélection du fichier TeX '{}'

source: Detecting several TeX files: {}
fr: Détection de plusieurs fichiers TeX: {}

source: Detecting TeX file from project's configuration: '{}'
fr: Détection du fichier TeX à partir de la configuration du document: '{}'

source: Using TeX file '{}'
fr: Utilisation du fichier TeX '{}'

source: Applying command line options
fr: Application des options de la ligne de commande

source: Selecting project's style for MakeIndex: {}
fr: Sélection du style pour MakeIndex: {}

source: Unable to selected a project's style for MakeIndex: no file or too many .ist files in directory {}
fr: Impossible de déterminer le style pour MakeIndex: pas de fichier .ist ou trop de fichiers .ist dans le répertoire {}

source: Selecting the system default style for MakeIndex
fr: Utilisation du style par défaut pour MakeIndex

source: Unselecting any style for MakeIndex
fr: Ignore les styles pour MakeIndex

source: Translate {} to {} with {} alternative
fr: Convertit {} vers {} avec la variante {}

source: Translate {} to {}
fr: Convertit {} vers {}

source: Get translator list from {}
fr: Calcul de la liste des convertisseurs depuis {}

source: Several possibilities exist for generating a figure from a {} file: {} You must specify which to include (resp. exclude) with --include (resp. --exclude). It is recommended to update your {} file with the following configuration for each translator to exclude (example on the translator {}): {}
fr: Plusieurs possibilités existent pour générer une fichier depuis un fichier {}: {} Vous devez spécifier les convertisseurs à inclure (resp. exclure) avec l'option --include (resp. --exclude). Il est recommandé de modifier votre fichier {} avec l'example de configuration ci-dessous pour chaque convertisseur à exclure (exemple avec le convertisseur {}): {}

source: Get loadable translators from {}
fr: Calcul des convertisseurs chargables depuis {}

source: Translator {} is ignored
fr: Le convertisseur {} est ignoré

source: Get translators from {}
fr: Chargement des convertisseurs depuis {}

source: Line outside a definition ({}:{}).
fr: Ligne en dehors d'une définition ({}:{})

source: The block for the variable '{}' is not closed. Keyword '{}' was not found ({}:{}).
fr: Le bloc pour la variable '{}' n'est pas fermé. Le mot-clé '{}' n'a pas été trouvé ({}:{}).

source: You cannot call runTranslator() outside the call stack of runRootTranslator().
fr: Vous ne pouvez pas appeller runTranslator() en dehors d'un appel à runRootTranslator().

source: {}: file not found or not readable.
fr: {}: fichier non trouvé ou non lisible.

source: {} is up-to-date.
fr: {} est à-jour.

source: Cannot find an interpreter wrapper for {}: {}
fr: Impossible de trouver un interpréteur pour {} : {}

source: Unable to find the method of translation for '{}'.
fr: Impossible de trouver un convertisseur pour '{}'.

source: Searching translator '{}'.
fr: Chargement des convertisseurs depuis {}

source: The translator '{}' cannot be found.
fr: Le convertisseur '{}' n'a pas été trouvé.

source: Linking '{}' to '{}'.
fr: Création d'un alias de '{}' vers '{}'.

source: '{}' is already loaded.
fr: '{}' est déjà chargé.

source: Loading translator '{}'.
fr: Calcul des convertisseurs chargeables depuis {}

source: Detecting images inside '{}'
fr: Détection des images dans '{}'

source: No read access to the VERSION file of AutoLaTeX. AutoLaTeX should not be properly installed. Assuming version: {}
fr: Impossible de lire le fichier VERSION de AutoLaTeX. AutoLaTeX a peut être été mal installé. Version considérée : {}

source: Unable to find the VERSION file of AutoLaTeX. AutoLaTeX should not be properly installed. Assuming version: {}
fr: Impossible de trouver le fichier VERSION de AutoLaTeX. AutoLaTeX a peut être été mal installé. Version considérée : {}

source: no manual page found
fr: pas de page de manuel trouvée

source: Warning: {}
fr: Avertissement : {}

source: Command line is: {}
fr: La ligne de commande : {}

source: Can't redirect STDOUT: {}
fr: Impossible de rediriger STDOUT : {}

source: Can't redirect STDERR: {}
fr: Impossible de rediriger STDERR : {}

source: Unable to fork for the system command: {}
fr: Impossible de créer un processus fils pour la commande : {}

source: Can't write {}: {}
fr: Impossible d'écrire {} : {}

source: Can't redirect STDIN: {}
fr: Impossible de rediriger STDIN : {}

source: Waiting for system command sub-processes
fr: En attente de la terminaison d'un sous-processus

source: Analysing {}
fr: Analyse de '{}'

source: Writing {}
fr: Ecriture de '{}'

source: Copying resource {} to {}
fr: Copie de la ressource {} dans {}

source: Picture not found: {}
fr: Image non trouvée : {}

source: File not found: {}
fr: Echec de lecture de {}: {}

source: you try to close with a '$' a mathematical mode opened with '\['
fr: vous essayez de fermer avec '$' un environnement mathématique ouvert avec '\['

source: you cannot use in text mode the active character '{}', which is defined in math mode
fr: vous ne pouvez pas utiliser le caractère actif '{}' en mode texte, car il est défini en mode mathématique.

source: you cannot use in math mode the active character '{}', which is defined in text mode
fr: vous ne pouvez pas utiliser le caractère actif '{}' en mode mathématique, car il est défini en mode texte.

source: invalid syntax for the TeX command: {}
fr: syntaxe invalide pour la macro TeX : {}

source: invalid syntax for the TeX active character: {}
fr: syntaxe invalide pour le caractère actif TeX : {}

source: Found parameter definition for '{}': math={}; text={}
fr: Définition des paramètres de '{}' : math={}; text={}

source: the command {}{} was not defined for math-mode, assumes to use the text-mode version instead
fr: la macro {}{} n'est pas définie en mode mathématique, la version définie en mode texte sera utilisé à la place

source: the command {}{} was not defined for text-mode, assumes to use the math-mode version instead
fr: la macro {}{} n'est pas définie en mode texte, la version définie en mode mathématique sera utilisé à la place

source: Expanding '{}'
fr: Remplacement de '{}'

source: Macro prototype of '{}': {}
fr: Prototype de la macro '{}' : {}

source: expected a TeX macro for expanding the macro {}, here: '{}'
fr: une macro TeX est attendue pour le développement de la macro {}, ici : '{}'

source: unable to recognize the following argument specification: {}
fr: spécification d'argument de macro TeX invalide : {}

source: Parsing '{}'
fr: Analyse de '{}'

source: Adding file '{}'
fr: Ajout du fichier '{}'

source: Parsing auxiliary files
fr: Analyse des fichiers auxiliaires

source: {}: Error when processing {}
fr: {} : Erreur lors de la génération de {}

source: {}: The first error found in the log file is:
fr: {}: La première erreur détectée dans le journal d'erreur est :

source: {}: End of error log.
fr: {}: Fin du journal d'erreur.

source: {}: Unable to extract the error from the log. Please read the log file.
fr: {}: Impossible d'extraire l'erreur depuis le journal. Veuillez lire le fichier journal.

source: Generating {}
fr: Génération de {}

source: Compiling {}
fr: Génération de {}

source: Analyzing logs for {}
fr: Analyse du journal de {}

source: LaTeX Warning: There were multiply-defined labels.
fr: Avertissement LaTeX : il existe des labels définis plusieurs fois.

source: LaTeX Warning: There were undefined references.
fr: Avertissement LaTeX : il existe des références vers des labels non définis.

source: LaTeX Warning: There were undefined citations.
fr: Avertissement LaTeX : il existe des références vers citations bibliographiques non définies.

source: LaTeX Warning: Please look inside {} for the other the warning messages.
fr: Avertissement LaTeX : Veuillez ouvrir {} pour plus de messages d'avertissement.

source: Style file: {}
fr: Fichier de style : {}
