Repository: gallandarakhneorg/autolatex
Catalog: po/*/LC_MESSAGES/autolatex-gedit3.po
Languages: fr

source: List of the figures detected in your document's directory. You can edit the second column to set the translator used for a particular figure.
fr: Liste des figures détectées dans le répertoire de votre document. Vous pouvez éditer la seconde colonne pour changer le convertisseur utilisé pour une figure particulière.

source: Translator
fr: Convertisseur

source: Automatic generation of pictures with translators
fr: Génération automatique d'images avec des convertisseurs

source: Search paths for the pictures
fr: Chemins de recherche pour les images

source: Select a figure path
fr: Sélectionner un chemin de recherche pour les images

source: Main TeX file (optional)
fr: Fichier TeX principal (optionnel)

source: Execute the bibliography tool (BibTeX, Bibber...)
fr: Exécution des outils bibliographique (BibTeX, Bibber, ...)

source: Type of generation
fr: Type de génération

source: Use SyncTeX when generating the document
fr: Utiliser SyncTeX lors de la génération du document

source: Type of style for MakeIndex
fr: Fichier '.ist' spécifique

source: Specific '.ist' file
fr: Autodétection du style dans le répertoire du document

source: Autodetect the style inside the project directory
fr: Utiliser seulement le style par défaut AutoLaTeX

source: Use only the default AutoLaTeX style
fr: Utiliser seulement le style par défaut AutoLaTeX

source: No style is passed to MakeIndex
fr: Pas de style pour MakeIndex

source: Custom definition by the user (do not change the original configuration)
fr: Définie par l'utilisateur (aucun changement de la config. originelle)

source: Style file for MakeIndex
fr: Fichier de style pour MakeIndex

source: Create a translator
fr: Création d'un convertisseur

source: Note: read the tooltips of the fields for help.
fr: Note: lisez les tooltips sur les champs pour obtenir une aide.

source: Input extensions
fr: Extensions des entrées

source: List of filename extensions, separated by spaces. Ex: .svg .svgz
fr: Liste des extensions de fichier, séparées par des espaces. Ex: .svg .svgz

source: PDF or Postscript
fr: PDF ou Postscript

source: TeX macros inside PDF or Postscript
fr: Macros TeX dans un PDF ou Postscript

source: Beamer Layer
fr: Calque Beamer

source: TeX macros inside Beamer Layer
fr: Macros TeX dans un calque Beamer

source: PNG Picture
fr: Image PNG

source: Output
fr: Sortie

source: Shell Command line
fr: Ligne de commande Shell

source: Script in %s
fr: Script dans %s

source: Execution mode
fr: Mode d'exécution

source: Command line
fr: Ligne de commande

source: Type a command line. Type: $in for the input filename; $out for the output filename; $outbasename for the basename with the dirname and extension; $outwoext for filename without the extension; $NAME for any environment variable named 'NAME'.
fr: Entrez la ligne de commande. Entrez : $in pour le nom de fichier d'entrée; $out pour le nom de fichier de sortie; $outbasename pour le nom de fichier de sortie sans répertoire, avec extension; $outwoext pour le nom de fichier de sortie sans répertoire ni extension; $NAME pour une variable d'environnement nommée 'NAME'.

source: Script source code
fr: Code source du script

source: Files to clean
fr: Fichiers à nettoyer

source: Type list of patterns, separated by spaces. Type: $in for the input basename without the extension and without the directory; $out for the output basename without the extension and without the directory.
fr: Entrez la liste des patrons, séparés par des espaces. Entrez : $in pour un nom de fichier d'entrée sans répertoire ni extension; $in pour un nom de fichier de sortie sans répertoire ni extension.

source: Type a source code. Type: #1in for the input filename; #1out for the output filename; #1outbasename for the basename without extension and dirname; #1outwoext for the filename without extension; #2inexts is the array of the input extensions; #1outext is the first output extension; #2outexts is the array of the output extensions; #1ispdfmode indicates if the translator is used in PDF mode; #1isepsmode indicates if the translator is used in EPS mode.
fr: Entrez un code source. Entrez : #1in pour le nom de fichier d'entrée; #1out pour le nom de fichier de sortie; #1outbasename pour le nom de fichier de sortie avec extension, sans répertoire; #1outwoext pour le nom de fichier de sortie avec extension ni répertoire; #2inexts est le tableau des extensions d'entrée; #1outext est la première extension de sortie; #2outexts est le tableau des extensions de sortie; #1ispdfmode indique si le convertisseur est en mode PDF; #1isepsmode indique si le convertisseur est en mode Postscript.

source: List of available translators: (click on the second column to change the loading state of the translators)
fr: Liste des convertisseurs disponibles : (cliquez sur la seconde colonne pour changer l'état de chargement des convertisseurs)

source: name
fr: nom

source: Import
fr: Importer

source: Current document
fr: Utilisateur

source: All users
fr: Tous le monde

source: Loaded, no conflict
fr: Chargé, sans conflit

source: Loaded, conflict
fr: Chargé, avec conflit

source: Not loaded
fr: Non chargé

source: Unspecified, no conflict
fr: Inconnu, sans conflit

source: Unspecified, conflict
fr: Inconnu, avec conflit

source: The translator file '%s' already exists. Do you want to replace it with the selected file?
fr: Le fichier du convertisseur '%s' existe déjà. Voulez-vous remplacer ce fichier par le fichier sélectionné ?

source: Cannot compute a valid basename with the inputs.
fr: Impossible de calculer un nom de fichier valide avec les données entrées.

source: Select a translator definition
fr: Sélectionnez une définition de convertisseur

source: AutoLaTeX Translator
fr: Convertisseur AutoLaTeX

source: There is a problem when reading the translator's definition. Please close and re-open the configuration dialog for trying to read the configuration of the new translator.
fr: Il y a un problème de lecture de la définition du convertisseur. Veuillez fermer la fenêtre de configuration, et la réouvrir pour tenter une nouvelle lecture de la définition.

source: Do you want to delete the translator '%s'?
fr: Voulez-vous supprimer le convertisseur '%s' ?

source: Launch a viewer after compilation
fr: Lancer un visualisateur après la compilation

source: Command for launching the viewer (optional)
fr: Commande pour lancer le visualisateur (optionnel)

source: Document Configuration
fr: Configuration pour le document

source: User Configuration
fr: Configuration au niveau utilisateur

source: Generator
fr: Génération

source: Figures
fr: Images

source: List of figures
fr: Liste des images

source: Translators
fr: Convertisseurs

source: Viewer
fr: Visualisateur

source: The page '%s' cannot save its fields. You will loose the changes on this pages.
fr: La page '%s' ne peut pas sauver ses champs. Vous allez perdre vos changements sur cette page.

source: Citation '%s' undefined
fr: La citation '%s' n'est pas définie

source: Reference '%s' undefined
fr: La référence '%s' n'est pas définie

source: Label '%s' multiply defined
fr: Le label '%s' est défini plusieurs fois

source: Overriding the value in the current configuration
fr: Surcharger les valeurs dans la configuration courante

source: Get the value from the inherited configuration
fr: Utiliser les valeurs hérités de la configuration utilisateur

source: The programs 'autolatex' and 'autolatex-backend' were not found. Please fix the configuration of the AutoLaTeX plugin.
fr: Les programmes 'autolatex' et 'autolatex-backend' n'ont pas été trouvés. Veuillez corriger la configuration du plugin AutoLaTeX.

source: The program 'autolatex' was not found. Please fix the configuration of the AutoLaTeX plugin.
fr: Le programme 'autolatex' n'a pas été trouvé. Veuillez corriger la configuration du plugin AutoLaTeX.

source: The program 'autolatex-backend' was not found. Please fix the configuration of the AutoLaTeX plugin.
fr: Le programme 'autolatex-backend' n'a pas été trouvé. Veuillez corriger la configuration du plugin AutoLaTeX.

source: AutoLaTeX Console
fr: Console AutoLaTeX

source: LaTeX warnings were found. Please open the bottom panel to see them.
fr: Des avertissements LaTeX ont été trouvés (voir le panneau inférieur).

source: Generate images
fr: Générer les images

source: Generate the images with AutoLaTeX
fr: Générer les images avec AutoLaTeX

source: Compile
fr: Compiler

source: Compile with AutoLaTeX
fr: Compiler avec AutoLaTeX

source: Remove temporary files
fr: Supprimer les fichiers temporaires

source: Clean with AutoLaTeX
fr: Nettoyer avec AutoLaTeX

source: Clean all
fr: Tout supprimer

source: Clean all with AutoLaTeX
fr: Tout supprimer avec AutoLaTeX

source: View the PDF
fr: Voir le PDF

source: Open the PDF viewer
fr: Ouverture du visualisateur PDF

source: Create flat version of the TeX document
fr: Création de la version "plate" du document TeX

source: Create a flat version of the document, to be submitted to on-line publication systems (Elsevier...)
fr: Création d'une version plate du document, afin de permettre la soumission à un système de publication on-line

source: Show next error/warning
fr: Afficher le message suivant

source: Show the next error or warning from the LaTeX console
fr: Afficher le message d'erreur ou d'avertissement suivant

source: Show previous error/warning
fr: Afficher le message précédent

source: Show the previous error or warning from the LaTeX console
fr: Afficher le message d'erreur ou d'avertissement prédédent

source: Document configuration
fr: Configuration pour le document

source: Change the configuration for the document
fr: Changer la configuration pour le document

source: Delete document configuration
fr: Supprimer configuration document

source: Delete the configuration for the document
fr: Supprimer la configuration pour le document

source: Delete user configuration
fr: Supprimer configuration utilisateur

source: Delete the configuration for the user
fr: Supprimer la configuration de l'utilisateur

source: Force the use of SyncTeX
fr: Forcer l'utilisation de SyncTeX

source: Use SyncTeX even if the document and user configurations say 'no'
fr: Utiliser SyncTeX même si les configurations du document et utilisateur indiquent le contraire

source: Update TeX file with SyncTeX reference
fr: Ajouter les références SyncTeX

source: Update the text of the TeX file to add the reference to the main document
fr: Modifier le texte du fichier TeX pour ajouter les références au document principal

source: User configuration
fr: Configuration de l'utilisateur

source: Change the configuration for the user
fr: Changer la configuration de l'utilisateur

source: Removing the generated files (except the figures)
fr: Suppression des fichiers générés (à l'exception des figures)

source: Removing the generated files and figures
fr: Suppression des fichiers et des figures générés

source: Generating the document
fr: Production du document

source: Generating the figures with the translators
fr: Génération des images avec les convertisseurs

source: Launching the viewer
fr: Ouverture du visualisateur PDF

source: Do you want to delete the document configuration?
fr: Voulez-vous supprimer le fichier de configuration de votre document ?

source: Do you want to delete the user configuration?
fr: Voulez-vous supprimer le fichier de configuration utilisateur ?

source: Making the "flat" version of the document
fr: Création de la version "plate" du document

source: Paths of the tools
fr: Chemins vers les outils

source: Path to 'autolatex-backend'
fr: Chemin de 'autolatex'

source: Enable SyncTeX (overriding the configurations)
fr: Autorise SyncTeX (surcharge les configurations)

source: Configuration of the UI
fr: Configuration de l'interface

source: Show the progress info bar
fr: Afficher la barre d'information et de progression

source: Configuration of the documents
fr: Configuration pour les documents

source: Save before running AutoLaTeX
fr: Enregistrer les documents avant d'exécuter AutoLaTeX

source: The path of AutoLaTeX has been changed by an external software. The new path is different from the one you have entered. Do you want to use the new path?
fr: Le chemin d'AutoLaTeX a été changé par un outil externe. Le nouveau chemin est différent de celui que vous avez entré. Voulez-vous utiliser ce nouveau chemin ?

source: The path of AutoLaTeX Backend has been changed by an external software. The new path is different from the one you have entered. Do you want to use the new path?
fr: Le chemin d'AutoLaTeX Backend a été changé par un outil externe. Le nouveau chemin est différent de celui que vous avez entré. Voulez-vous utiliser ce nouveau chemin ?

source: The enabling flag for SyncTeX has been changed by an external software. The new flag is different from the one inside the preference dialog box. Do you want to use the new flag?
fr: L'indicateur d'activiation pour SyncTeX a été modifié par un programme externe. Sa nouvelle valeur est différente de celle présente dans la fenêtre des préférences. Voulez-vous utiliser la nouvelle valeur ?

source: The enabling flag for the progress info bar has been changed by an external software. The new flag is different from the one inside the preference dialog box. Do you want to use the new flag?
fr: L'indicateur d'activiation de la barre de progression a été modifié par un programme externe. Sa nouvelle valeur est différente de celle présente dans la fenêtre des préférences. Voulez-vous utiliser la nouvelle valeur ?

source: The flag to save before running AutoLaTeX has been changed by an external software. The new flag is different from the one inside the preference dialog box. Do you want to use the new flag?
fr: L'indicateur de sauvegarde des documents avant une exécution d'AutoLateX a été modifié par un programme externe. Sa nouvelle valeur est différente de celle présente dans la fenêtre des préférences. Voulez-vous utiliser la nouvelle valeur ?

source: Internal Error: Unable to retreive the undefined references from the LaTeX log
fr: Erreur interne: impossible de retrouver les références non définies dans le journal LaTeX

source: Internal Error: Unable to retreive the multidefined references from the LaTeX log
fr: Erreur interne: impossible de retrouver les références définies plusieurs fois dans le journal LaTeX

source: Internal Error: Unable to retreive the undefined citations from the LaTeX log
fr: Erreur interne: impossible de retrouver les citations non définies dans le journal LaTeX
